In [1]:
# Dependencies
import pandas as pd

In [2]:
# Save path to data set in a variable
path = "Resources/dataSet.csv"

In [ ]:
# Use Pandas to read data
data_file_pd = pd.read_csv(path)

In [21]:
data_file_pd.tail(10)

       id  First Name Last Name Gender   Amount
990   991       Norma   Daniels      F  10847.3
991   992    Margaret      Hart      F  17337.6
992   993       Debra      Bell      F  18906.5
993   994       Aaron  Mitchell      M  19881.7
994   995      Bonnie      Lane      F   6720.7
995   996       Paula      Reed      F  17868.5
996   997       Paula       Fox      F  15182.9
997   998      Thomas   Andrews      M   3720.7
998   999  Jacqueline    Moreno      F  10824.6
999  1000     Deborah     Young      F   6090.7

In [10]:
# Display a statistical overview of the DataFrame
data_file_pd.describe()

                id        Amount
count  1000.000000   1000.000000
mean    500.500000  10051.323600
std     288.819436   5831.230806
min       1.000000      3.400000
25%     250.750000   4854.875000
50%     500.500000  10318.050000
75%     750.250000  15117.425000
max    1000.000000  19987.400000

In [12]:
# Reference a single column within a DataFrame
data_file_pd["Amount"].head()

0     8067.7
1     7330.1
2    16335.0
3    12460.8
4    15271.9
Name: Amount, dtype: float64

In [16]:
# Reference multiple columns within a DataFrame
data_file_pd[["Amount", "Gender"]].head(10)

    Amount Gender
0   8067.7      M
1   7330.1      M
2  16335.0      F
3  12460.8      F
4  15271.9      F
5   7036.9      M
6  14002.2      F
7  10911.0      M
8  14198.8      F
9  16410.5      M

In [14]:
# The mean method averages the series
average = data_file_pd["Amount"].mean()
average

10051.323600000002

In [15]:
# The sum method adds every entry in the series
total = data_file_pd["Amount"].sum()
total

10051323.600000001

In [18]:
# The unique method shows every element of the series that appears only once
unique = data_file_pd["Gender"].unique()
unique

array(['M', 'F'], dtype=object)

In [19]:
# The value_counts method counts unique values in a column
count = data_file_pd["Gender"].value_counts()
count

M    515
F    485
Name: Gender, dtype: int64

In [20]:
# Calculations can also be performed on Series and added into DataFrames as new columns
thousands_of_dollars = data_file_pd["Amount"]/1000